GetSketchyLines Method
 Returns the current sketchy lines settings for the view.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2015
 Syntax
  C#
public ViewDisplaySketchyLines GetSketchyLines()
  Visual Basic
Public Function GetSketchyLines As ViewDisplaySketchyLines
  Visual C++
public:
ViewDisplaySketchyLines^ GetSketchyLines()
 Return Value
 Current sketchy lines settings.
 See Also
  View Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →